{
  "architectures": [
    "PaddleOCRVLForConditionalGeneration"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_paddleocr_vl.PaddleOCRVLConfig",
    "AutoModel": "modeling_paddleocr_vl.PaddleOCRVLForConditionalGeneration",
    "AutoModelForCausalLM": "modeling_paddleocr_vl.PaddleOCRVLForConditionalGeneration"
  },
  "compression_ratio": 1.0,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1024,
  "ignored_index": -100,
  "image_token_id": 100295,
  "intermediate_size": 3072,
  "max_position_embeddings": 131072,
  "max_sequence_length": null,
  "model_type": "paddleocr_vl",
  "num_attention_heads": 16,
  "num_hidden_layers": 18,
  "num_key_value_heads": 2,
  "pad_token_id": 0,
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "mrope_section": [
      16,
      24,
      24
    ],
    "rope_type": "default",
    "type": "default"
  },
  "rope_theta": 500000,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.55.0",
  "use_bias": false,
  "use_cache": false,
  "use_flash_attention": false,
  "video_token_id": 101307,
  "vision_config": {
    "architectures": [
      "PaddleOCRVisionModel"
    ],
    "attention_dropout": 0.0,
    "auto_map": {
      "AutoConfig": "configuration_paddleocr_vl.PaddleOCRVLConfig",
      "AutoModel": "modeling_paddleocr_vl.PaddleOCRVisionModel"
    },
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 1152,
    "image_size": 384,
    "intermediate_size": 4304,
    "layer_norm_eps": 1e-06,
    "model_type": "paddleocr_vl",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 27,
    "pad_token_id": 0,
    "patch_size": 14,
    "spatial_merge_size": 2,
    "temporal_patch_size": 2,
    "tokens_per_second": 2,
    "torch_dtype": "bfloat16"
  },
  "vision_start_token_id": 101305,
  "vision_end_token_id": 101306,
  "vocab_size": 103424,
  "weight_share_add_bias": true,
  "use_3d_rope": true,
  "rope_is_neox_style": true
}
